In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df=pd.read_csv("employee.csv")

In [3]:
df.head()

,Emp ID,Name Prefix,First Name,Middle Initial,Last Name,Gender,E Mail,Father's Name,Mother's Name,Mother's Maiden Name,...,SSN,Phone No.,Place Name,County,City,State,Zip,Region,User Name,Password
0,850297,Ms.,Shawna,W,Buck,F,shawna.buck@gmail.com,Rosario Buck,Keisha Buck,Hendricks,...,222-11-7603,702-771-7149,Las Vegas,Clark,Las Vegas,NV,89128,West,swbuck,ja8?k3BTF^]o@<&
1,304721,Mr.,Nathaniel,Z,Burke,M,nathaniel.burke@walmart.com,Derrick Burke,Phoebe Burke,Pugh,...,550-99-9897,231-765-6923,Irons,Lake,Irons,MI,49644,Midwest,nzburke,tPA@4Wh9Ja$+Ln
2,412317,Drs.,Elisabeth,W,Foster,F,elisabeth.foster@gmail.com,Irwin Foster,Janie Foster,Delaney,...,215-91-0004,270-749-4774,Lexington,Fayette,Lexington,KY,40501,South,ewfoster,5D.B4IGNkWJfG<~
3,621375,Mrs.,Briana,C,Lancaster,F,briana.lancaster@yahoo.com,Jeffrey Lancaster,Shelby Lancaster,Weiss,...,534-71-1053,219-623-8216,Munster,Lake,Munster,IN,46321,Midwest,bclancaster,I%?JDM;pW
4,787549,Hon.,Estella,L,Potter,F,estella.potter@gmail.com,Booker Potter,Katelyn Potter,Pate,...,644-29-6396,907-677-8486,Fairbanks,Fairbanks North Star,Fairbanks,AK,99709,West,elpotter,j4jkEXfC&Rh

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 37 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Emp ID                  1000 non-null   int64
 1   Name Prefix             1000 non-null   object
 2   First Name              1000 non-null   object
 3   Middle Initial          1000 non-null   object
 4   Last Name               1000 non-null   object
 5   Gender                  1000 non-null   object
 6   E Mail                  1000 non-null   object
 7   Father's Name           1000 non-null   object
 8   Mother's Name           1000 non-null   object
 9   Mother's Maiden Name    1000 non-null   object
 10  Date of Birth           1000 non-null   object
 11  Time of Birth           1000 non-null   object
 12  Age in Yrs.             1000 non-null   float64
 13  Weight in Kgs.          1000 non-null   int64
 14  Date of Joining         1000 non-null   object
 15  Quarter of Joining      1000 non-null   object
 16  Half of Joining         1000 non-null   object
 17  Year of Joining         1000 non-null   int64
 18  Month of Joining        1000 non-null   int64
 19  Month Name of Joining   1000 non-null   object
 20  Short Month             1000 non-null   object
 21  Day of Joining          1000 non-null   int64
 22  DOW of Joining          1000 non-null   object
 23  Short DOW               1000 non-null   object
 24  Age in Company (Years)  1000 non-null   float64
 25  Salary                  1000 non-null   int64
 26  Last % Hike             1000 non-null   object
 27  SSN                     1000 non-null   object
 28  Phone No.               1000 non-null   object
 29  Place Name              1000 non-null   object
 30  County                  1000 non-null   object
 31  City                    1000 non-null   object
 32  State                   1000 non-null   object
 33  Zip                     1000 non-null   int64
 34  Region                  1000 non-null   object
 35  User Name               1000 non-null   object
 36  Password                1000 non-null   object
dtypes: float64(2), int64(7), object(28)
memory usage: 289.2+ KB

In [5]:
df.shape

(1000, 37)

In [6]:
df.isnull().sum()
#checking whether there is null value or not

Emp ID                    0
Name Prefix               0
First Name                0
Middle Initial            0
Last Name                 0
Gender                    0
E Mail                    0
Father's Name             0
Mother's Name             0
Mother's Maiden Name      0
Date of Birth             0
Time of Birth             0
Age in Yrs.               0
Weight in Kgs.            0
Date of Joining           0
Quarter of Joining        0
Half of Joining           0
Year of Joining           0
Month of Joining          0
Month Name of Joining     0
Short Month               0
Day of Joining            0
DOW of Joining            0
Short DOW                 0
Age in Company (Years)    0
Salary                    0
Last % Hike               0
SSN                       0
Phone No.                 0
Place Name                0
County                    0
City                      0
State                     0
Zip                       0
Region                    0
User Name                 0
Password                  0
dtype: int64

In [7]:
df_salary=df.copy()
#creating a copy for visulaization purposes

In [8]:
from sklearn.preprocessing import LabelEncoder
labelencoder=LabelEncoder()
for column in df.columns:
    df[column] = labelencoder.fit_transform(df[column])

In [9]:
df.head()

,Emp ID,Name Prefix,First Name,Middle Initial,Last Name,Gender,E Mail,Father's Name,Mother's Name,Mother's Maiden Name,...,SSN,Phone No.,Place Name,County,City,State,Zip,Region,User Name,Password
0,820,5,695,22,72,0,879,810,510,262,...,301,970,410,106,410,32,893,3,905,730
1,246,3,575,25,75,1,730,249,786,476,...,734,500,362,276,362,21,518,0,752,895
2,352,1,233,22,191,0,300,450,419,153,...,289,674,423,184,423,16,422,2,331,78
3,580,4,96,2,326,0,118,497,882,608,...,714,420,521,276,521,14,481,0,67,280
4,748,2,261,11,471,0,335,95,495,450,...,845,992,236,177,236,0,989,3,313,713

In [10]:
corr_matrix=df.corr()
corr_matrix["Salary"].sort_values(ascending=False)

Salary                    1.000000
Weight in Kgs.            0.062313
Age in Company (Years)    0.061454
Gender                    0.051416
Age in Yrs.               0.041310
Last Name                 0.026313
Middle Initial            0.026117
Password                  0.016696
State                     0.015257
Father's Name             0.010198
Zip                       0.007816
Half of Joining           0.004894
Phone No.                 0.000605
Time of Birth            -0.002173
County                   -0.002772
Mother's Name            -0.003324
Mother's Maiden Name     -0.006443
Date of Birth            -0.013257
Quarter of Joining       -0.016617
Day of Joining           -0.019796
Month of Joining         -0.020463
Name Prefix              -0.021461
Date of Joining          -0.023513
Emp ID                   -0.026797
Region                   -0.028343
Last % Hike              -0.037167
Month Name of Joining    -0.038356
Short Month              -0.038356
SSN                      -0.046152
User Name                -0.051845
Place Name               -0.052930
City                     -0.052930
Year of Joining          -0.053378
First Name               -0.057438
E Mail                   -0.057618
DOW of Joining           -0.070871
Short DOW                -0.070871
Name: Salary, dtype: float64

In [11]:
df.columns

Index(['Emp ID', 'Name Prefix', 'First Name', 'Middle Initial', 'Last Name',
       'Gender', 'E Mail', 'Father's Name', 'Mother's Name',
       'Mother's Maiden Name', 'Date of Birth', 'Time of Birth', 'Age in Yrs.',
       'Weight in Kgs.', 'Date of Joining', 'Quarter of Joining',
       'Half of Joining', 'Year of Joining', 'Month of Joining',
       'Month Name of Joining', 'Short Month', 'Day of Joining',
       'DOW of Joining', 'Short DOW', 'Age in Company (Years)', 'Salary',
       'Last % Hike', 'SSN', 'Phone No. ', 'Place Name', 'County', 'City',
       'State', 'Zip', 'Region', 'User Name', 'Password'],
      dtype='object')

In [12]:
#dropping unuseful variables 
df_new=pd.DataFrame(data=df_salary,columns=['Emp ID', 'Date of Joining', 'Quarter of Joining',"Half of Joining", "Year of Joining",'Age in Yrs.', 'Age in Company (Years)','Last % Hike','Salary'])

In [13]:
df_new.head()

,Emp ID,Date of Joining,Quarter of Joining,Half of Joining,Year of Joining,Age in Yrs.,Age in Company (Years),Last % Hike,Salary
0,850297,12/18/2010,Q4,H2,2010,45.66,6.61,17%,119090
1,304721,4/25/2017,Q2,H1,2017,23.76,0.26,14%,117991
2,412317,3/27/2017,Q1,H1,2017,22.68,0.34,28%,161045
3,621375,2/25/2003,Q1,H1,2003,41.70,14.43,16%,142616
4,787549,10-11-2016,Q4,H2,2016,22.39,0.79,11%,135706

In [14]:
df_new["Last % Hike"]=pd.to_numeric(df["Last % Hike"],errors="coerce")
from sklearn.preprocessing import LabelEncoder
labelencoder=LabelEncoder()
df_new["Quarter of Joining"] = labelencoder.fit_transform(df_new["Quarter of Joining"])
df_new["Half of Joining"] = labelencoder.fit_transform(df_new["Half of Joining"])
df_new["Year of Joining"] = labelencoder.fit_transform(df_new["Year of Joining"])

In [15]:
corr_matrix=df_new.corr()
corr_matrix["Salary"].sort_values(ascending=False)

Salary                    1.000000
Age in Company (Years)    0.054212
Age in Yrs.               0.041422
Half of Joining           0.005996
Quarter of Joining       -0.015299
Emp ID                   -0.027248
Last % Hike              -0.039161
Year of Joining          -0.053501
Name: Salary, dtype: float64

In [38]:
from scipy import stats
from scipy import stats
import numpy as np
z = np.abs(stats.zscore(df))
threshold=3

In [39]:
df =df[(z < 3).all(axis=1)]

In [40]:
#splitting data
x=df.drop("Salary",axis=1)
y=df["Salary"]

In [41]:
df_salary.skew()

Emp ID                    0.029501
Age in Yrs.               0.006173
Weight in Kgs.            0.657110
Year of Joining          -0.958797
Month of Joining          0.057287
Day of Joining           -0.143305
Age in Company (Years)    0.968211
Salary                    0.034356
Zip                       0.147698
dtype: float64

In [42]:
from sklearn.preprocessing import StandardScaler
sc=StandardScaler()
sc.fit(x)
df_x=sc.transform(x)
df_x=pd.DataFrame(x,columns=x.columns)

In [48]:
from sklearn.model_selection import train_test_split#importing fuction to do train and test
from sklearn.linear_model import LinearRegression
from sklearn import metrics
from sklearn.metrics import r2_score
from sklearn.metrics import mean_absolute_error
from sklearn.metrics import mean_squared_error

In [49]:
x=df.to_numpy()
y=df.to_numpy()

In [55]:
from sklearn.model_selection import train_test_split,cross_val_score
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size = 0.2, random_state = 50)

In [56]:
lr=LinearRegression()
lr.fit(x_train,y_train)
y_pred=lr.predict(x_test)

In [57]:
r_sq = model.score(x, y)
print('coefficient of determination:', r_sq)

coefficient of determination: 1.0

In [63]:
cross_val_score(lr,x,y,cv=10,scoring="r2").mean()

1.0